content/blog/keyboard-shortcuts.md
+++
title = "Keyboard shortcuts"
author = ["Robert Clay"]
date = 2021-01-09
lastmod = 2024-08-14T08:52:56+09:00
categories = ["topic"]
draft = false
+++

<span class="timestamp-wrapper"><span class="timestamp">[2021-01-09 Sat]</span></span>,#keybindings


## Keyboards are not the perfect input device {#keyboards-are-not-the-perfect-input-device}

...but I sure do like them better than mice. I was listening to youtube talk by
an amazing speaker who was using a story about the tech industry to make his
point. He said that the mouse and the graphic user interface (GUI) democratized
the computer. I think he made a good point. The fact people can work with a
mouse and not need to interact with a computer in terms of text and code
certainly opened the doors for myriads of people to harness the power of the
computer. And I think that is great. But I also see how stopping at the mouse is
missing a huge opportunity when it comes to interacting with a computer.


## Using a keyboard is usually faster than a mouse {#using-a-keyboard-is-usually-faster-than-a-mouse}

If you do some searching online, you will see many people who argue that a
keyboard driven paradigm for working with your computer is needlessly
complicated. Their arguments tend to cover points like:

1.  I need to reach for the mouse for my GUI only apps anyway.
2.  Keyboard shortcuts aren't standardized. I can't remember them all.
3.  The time you save really isn't that much.

\#1 sure, I agree. One of the reasons I don't like the internet is because of how
mouse-driven it is. There are ways around it (sometimes) but most of the
internet seems to be built for those who only "click". I don't think this means
it's worth abandoning keyboard-based interactions when they are available.

\#2 Also true. This one bugs me to no end some days, but I have found that many
of my favorite pieces of software also let me re-map keyboard short cuts to keep
things more consistent.

\#3 This one I disagree with. Many years ago I went to a (Apple's) Logic Pro
music software training center in California. I went there to get a
certification, which I passed. The other people I took the test with were
professional music makers, and their time is money. Once gentleman put it this
way:

"...if you have a task you do a hundred times a day and you can save a second
off the time it takes you to do it, that's 100 seconds a day. Multiply that over
weeks and months and you are saving hours of time. Think of how long it takes
you to move your hand from the keyboard to the mouse. That time is what you are
saving by using a keyboard shortcut."


## Shortcuts help because software is complicated {#shortcuts-help-because-software-is-complicated}

If software were simpler, I don't think there would as much of a need for
keyboard shortcuts. At some level, keyboard shortcuts are another way to access
menus and configurations. If there were less things to configure or access
through menus, I don't think shortcuts would be as effective. But software has a
lot going on, and only so much can be shown with the visual. Some of the
complexity is better hidden away where you can't see it. So let's look at
something pretty simple. Saving a file:

|   | mouse                  | keyboard shortcut         |
|---|------------------------|---------------------------|
| 1 | reach for mouse        | reach for keyboard        |
| 2 | move mouse to menu-bar | [C-s] or equivalent       |
| 3 | click on "file" menu   | confirm save with [enter] |
| 4 | move mouse to "save"   |                           |
| 5 | click on "save"        |                           |
| 6 | move mouse to confirm  |                           |
| 7 | click on confirm       |                           |

This is only a fairly simple example. But simple changes from moving a mouse
between elements of a GUI to moving you ringers between keys on a keyboard can
make a big difference over many many repetitions of the same operation.


## If your software has it, use a fuzzy-matching contextual menu {#if-your-software-has-it-use-a-fuzzy-matching-contextual-menu}

While I can't use Emacs for most of what I do day in and day out on a computer,
I have found an increasing fondness for a command it has called "Meta X" (or
[M-x] in emacs binding notation). It pulls up a prompt allowing you to call
items from the numerous menus in the program... by name. You might say it takes
longer to type the name "calc-dispatch" than it does to move a mouse and click,
but being able to call it by name means I don't need to remember where it's
located. I just need to know the name. And because the command has been modified
to use fuzzy matching, I don't need to write the whole name. I can start typing
it and hit enter when it's the top result of commands with those letters in it.
Which is why I have also decided to use the Vivaldi web browser.

Many people will brag about how fast their browsers are. How quickly they can
load web-pages. And by the same argument above (many repetitions of the same
things make for big time savings in the long run) faster page load times should
be king when it comes to web-browsing. Be that as it may, I like Vivaldi because
it has something similar to the "Meta X" command in Emacs that lets me access
nearly all the functionality of the browser without ever leaving the home row of
my keyboard. If I know the exact keyboard shortcut I can use that instead, but
being able to call menu items without needing to use my mouse (AND I can call
menu items that have no shortcut assigned to them!) is very nice indeed.


## ...and if you can configure and use key-bindings, they are totally worth it. {#dot-dot-dot-and-if-you-can-configure-and-use-key-bindings-they-are-totally-worth-it-dot}

It used to be that a highly keyboard centric text editor meant you needed to use
Vim or Emacs. These are still both amazing pieces of software worth looking
into, but you can get vim-like keybindings in many other text editors these
days. VS-code, perhaps the most popular text-editor at the moment, even has a
package called "VSpaceCode" <https://github.com/VSpaceCode/VSpaceCode> which
provides many of the editor bindings that come with a highly popular Emacs
distribution. Keyboard shortcuts don't only exist for complicated esoteric
software. And while I feel Emacs is one of the best keyboard-centric interfaces
I have ever used, I don't think it's for everyone. But VS Coda certainly DOES
aim to be the text-editor for everyone. And while taking the time to learn how
to do what you used to do with a mouse at the keyboard takes time I have found
it makes a world of difference in how quickly, easily, and enjoyably I get to
use my software.
